#include <Windows.h>

#ifdef COUNT_API
#define COUNT_API __declspec(dllexport) 
#else
#define COUNT_API __declspec(dllimport) 
#endif


////////////////////////////////////////////////////////////////////////////
// здесь определ€ютс€ все структуры данных и идентификаторы (символы)
////////////////////////////////////////////////////////////////////////////
// здесь определ€ютс€ прототипы экспортируемых функций
extern "C" COUNT_API int WordsCount(const wchar_t* text);
//////////////////////////////  онец файла /////////////////////////////////#pragma once
